In [32]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector

In [33]:
db= mysql.connector.connect(host= 'localhost',
                   username= 'root',
                   password= '123#Priyam#123',
                   database= 'ecommerce')
cur= db.cursor()

## 1. List all unique cities where customers are located.

In [41]:
query= """ select distinct customer_city from customers """
cur.execute(query)

data= cur.fetchall()
df= pd.DataFrame(data, columns= ['Cities'])
print('Cities where customers are located are:')
df

Cities where customers are located are:

                     Cities
0                    franca
1     sao bernardo do campo
2                 sao paulo
3           mogi das cruzes
4                  campinas
...                     ...
4114                 siriji
4115    natividade da serra
4116           monte bonito
4117             sao rafael
4118      eugenio de castro

[4119 rows x 1 columns]

## 2. Count the number of orders placed in 2017.

In [16]:
query= """ select count(order_id) from orders where order_purchase_timestamp = 2017 """
cur.execute(query)

data= cur.fetchall()
print('Total orders plased in 2017 are =', data[0][0])

Total orders plased in 2017 are = 45101

## 3. Find the total sales per category.

In [43]:
query= """ select upper(products.product_category) as category, round(sum(payments.payment_value), 2) as sales
            from products join order_items
            on products.product_id = order_items.product_id
            join payments
            on payments.order_id = order_items.order_id
            group by category """
cur.execute(query)

data= cur.fetchall()
df= pd.DataFrame(data, columns= ['Category', 'Sales'])
print('Total sales per categories are:')
df

Total sales per categories are:

                       Category       Sales
0                     PERFUMERY   506738.66
1          FURNITURE DECORATION  1430176.39
2                     TELEPHONY   486882.05
3                BED TABLE BATH  1712553.67
4                    AUTOMOTIVE   852294.33
..                          ...         ...
69               CDS MUSIC DVDS     1199.43
70                   LA CUISINE     2913.53
71  FASHION CHILDREN'S CLOTHING      785.67
72                     PC GAMER     2174.43
73       INSURANCE AND SERVICES      324.51

[74 rows x 2 columns]

## 4. Calculate the percentage of orders that were paid in installments.

In [54]:
query= """ select (sum(case when payment_installments >= 1 then 1 else 0 end))/ count(*)*100 as cnt from payments """
cur.execute(query)

data= cur.fetchall()
print('The percentage of orders which are paid via installments is: ', data[0][0], '%')

The percentage of orders which are paid via installments is:  99.9981 %

## 5. Count the number of customers from each state.

In [66]:
query= """ select customer_state, count(customer_id) from customers group by customer_state """
cur.execute(query)

data= cur.fetchall()
df = pd.DataFrame(data, columns= ['State', 'No. of Customers'])
print('The number of customer from each states are: ')
df

The number of customer from each states are:

   State  No. of Customers
0     SP             41746
1     SC              3637
2     MG             11635
3     PR              5045
4     RJ             12852
5     RS              5466
6     PA               975
7     GO              2020
8     ES              2033
9     BA              3380
10    MA               747
11    MS               715
12    CE              1336
13    DF              2140
14    RN               485
15    PE              1652
16    MT               907
17    AM               148
18    AP                68
19    AL               413
20    RO               253
21    PB               536
22    TO               280
23    PI               495
24    AC                81
25    SE               350
26    RR                46